Autodesk.Revit.DB.IGeometryAugmentationServer.GetMoveConstraints(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.MoveConstraintSettings)
Provides a way to constrain the movement of a movable geometry object.
Remarks:
This function is called whenever a movable external geometry is about to move.
Use it to provide a way to optionally restrict the movement in different ways using the settings object.
document:
The document where the target element exists.
viewId:
The id of the view where this element will be drawn.
targetId:
The id for the element that owns the ExternalGeometryId.
geometryId:
The ExternalGeometryId of the moving geometry.
moveConstraintSettings:
Use this object to customize the move constraint settings.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer.GetCoordinateSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Provides the coordinate system for the movable geometry. This coordinate system is where the offset transforms are stored relative to it.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Since:
2025

Autodesk.Revit.DB.IGeometryAugmentationServer.GetMovableReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Provides a list of all the ExternalGeometryId that are going to be movable in this element.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Returns:
Set containing all the ExternalGeometryIds that are going to be movable in this element.
Since:
2025

Autodesk.Revit.DB.IGeometryAugmentationServer
Represents an interface that should be overridden by servers that can generate and update data for associated elements.
This is part of the Geometry Augmentation system implementation.
This server was designed to be public_api but in the end it was decided to be moved to public_api_internal
because Servers created by third party Plugin are not available for Revit files published the in the cloud.
The callback for computing the augmented geometry happens during generateGrep. If the Plugin is not available
at this time, no augmented geometry will be created.
Decision can be found here:
https://autodesk.slack.com/archives/C02KQUH4519/p1673018478447789
https://wiki.autodesk.com/display/aeceng/Public+availability+of+the+Custom+Graphics+API#decision_framework-1761429744
Remarks:
IGeometryAugmentationServer can be attached to elements using Autodesk::Revit::DB::GeometryAugmentationRegistry::registerToServer.
Since:
2024